code-review/NRB_3471_3546/База_Было/DataProcessors/ПовышениеПравДляРазработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПовышениеПравДляРазработчиков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПользователиДляОбновления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПользователя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравоАдминистратор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныеПрава</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ПовышениеПравДляРазработчиков/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Выполняет повышение прав пользователям, которые имеют право-признак ПолныеПраваДляDEV
Процедура ПовыситьПраваПользователей() Экспорт
	ОбновитьДанныеПользователей();
	ПрименитьПраваДляПользователей();
	ОтключитьЗащитуОтОпасныхДействийДляАдминистратора();
КонецПроцедуры

// Заполняет табличную часть актуальными данными о пользователях, которые имеют право-признак ПолныеПраваДляDEV
Процедура ОбновитьДанныеПользователей() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	МассивПользователейБД = ПользователиИнформационнойБазы.ПолучитьПользователей();
	ПользователиДляОбновления.Очистить();
	
	РольДляПоиска = Метаданные.Роли.ПолныеПраваДляDEV;
	РольАдминистратор = Метаданные.Роли.Администратор;
	РольПолныеПрава = Метаданные.Роли.ПолныеПрава;
	
	Для Каждого ПользовательБД Из МассивПользователейБД Цикл
		
		Если ПользовательБД.Роли.Содержит(РольДляПоиска) Тогда
			СтрокаТаблицы = ПользователиДляОбновления.Добавить();
			СтрокаТаблицы.ИмяПользователя = ПользовательБД.Имя;
			СтрокаТаблицы.ПравоАдминистратор = ПользовательБД.Роли.Содержит(РольАдминистратор);
			СтрокаТаблицы.ПолныеПрава = ПользовательБД.Роли.Содержит(РольПолныеПрава);
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Изменяет роли пользователей, которые имеют право-признак ПолныеПраваДляDEV, добавляя набор прав
Процедура ПрименитьПраваДляПользователей() Экспорт

	Если ПользователиДляОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивРолейНаДобавление = Новый Массив;
	МассивРолейНаДобавление.Добавить(Метаданные.Роли.Администратор);
	МассивРолейНаДобавление.Добавить(Метаданные.Роли.ПолныеПрава);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ПользовательДляОбновления Из ПользователиДляОбновления Цикл
		ИмяПользователя = ПользовательДляОбновления.ИмяПользователя;
		Попытка
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
			ТребуетсяЗаписьПользователя = Ложь;
			Для Каждого Роль Из МассивРолейНаДобавление Цикл
				Если Не ПользовательИБ.Роли.Содержит(Роль) Тогда
					ТребуетсяЗаписьПользователя = Истина;
					ПользовательИБ.Роли.Добавить(Роль);
				КонецЕсли;
			КонецЦикла;
			Если ТребуетсяЗаписьПользователя Тогда
				ПользовательИБ.Записать();
				Текст = "Повысили права доступа пользователю <" + ИмяПользователя + ">";
				ЗаписьЖурналаРегистрации("ПовышениеПравДляРазработчиков.ПрименитьПраваДляПользователей",
					УровеньЖурналаРегистрации.Информация, , , Текст);
			КонецЕсли;
		Исключение
			Текст = "Не удалось добавить роли для <" + ИмяПользователя + ">" + ОписаниеОшибки();
			ДобавитьВЛог(Текст);
			ЗаписьЖурналаРегистрации("ПовышениеПравДляРазработчиков.ПрименитьПраваДляПользователей",
				УровеньЖурналаРегистрации.Ошибка, , , Текст);
		КонецПопытки;

	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Отключает признак Защита от опасных действий пользователю Администратор
Процедура ОтключитьЗащитуОтОпасныхДействийДляАдминистратора() Экспорт
	ПользовательАдминистратор = ПользователиИнформационнойБазы.НайтиПоИмени("Администратор");
	Если ПользовательАдминистратор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяОтключитьЗащитуОтОпасныхДействий = ПользовательАдминистратор.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях;
	Если Не ТребуетсяОтключитьЗащитуОтОпасныхДействий Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПользовательАдминистратор.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		ПользовательАдминистратор.Записать();
		Текст = "Отключена защита от опасных действий пользователю ""Администратор""";
		ЗаписьЖурналаРегистрации("ПовышениеПравДляРазработчиков.ОтключитьЗащитуОтОпасныхДействийДляАдминистратора",
			УровеньЖурналаРегистрации.Информация, , , Текст);
	Исключение
		Текст = "Не удалось отключить защиту от опасных действий пользователю ""Администратор"" " + ОписаниеОшибки();
		ДобавитьВЛог(Текст);
		ЗаписьЖурналаРегистрации("ПовышениеПравДляРазработчиков.ОтключитьЗащитуОтОпасныхДействийДляАдминистратора",
			УровеньЖурналаРегистрации.Ошибка, , , Текст);
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавление текста в реквизит Лог
//
// Параметры:
//  Текст	 - Строка - Добавляемый в лог текст
//
Процедура ДобавитьВЛог(Текст)
	Лог = Лог + Текст + Символы.ПС;
КонецПроцедуры 

#КонецОбласти


ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
